![](shiva.jpg)

# Problem Statement 1:
Is gender independent of education level? A random sample of 395 people were 
surveyed and each person was asked to report the highest education level they 
obtained. The data that resulted from the survey is summarized in the following table:
High School Bachelors Masters Ph.d. Total
Female 60 54 46 41 201
Male 40 44 53 57 194
Total 100 98 99 98 395
Question: Are gender and education level dependent at 5% level of significance? In
other words, given the data collected above, is there a relationship between the 
gender of an individual and the level of education that they have obtained?

In [1]:
import pandas as pd
import numpy as np
import scipy.stats as st

In [2]:
#Chi square test
df=pd.DataFrame(data={'High_School':[60,40,100],'Bachelors':[54,44,98],'Masters':[46,53,99],'Phd':[41,57,98],'Row_Total':[201,194,395]},index=['Female','Male','Column_Total'])

In [3]:
df

              High_School  Bachelors  Masters  Phd  Row_Total
Female                 60         54       46   41        201
Male                   40         44       53   57        194
Column_Total          100         98       99   98        395

In [4]:
#Null hypothesis='There is no relation between gender and education level'
#Alternative hypothesis='There is relation between gender and education level'
alpha=0.05
dof=3 #4-1=3 3-1=2 dof=3*1
#Value of chi square test is 7.81473 (got it from the table)
value=7.81473
#decision rule if chi square is greater than 15.5073 we reject null hypothesis

In [5]:
observed_value=df.iloc[:2,:4].values

In [6]:
exp_val=[[],[]]
for a in range(2):
    for b in range(4):
        exp_val[a].append(round((df.iloc[2][:4][b]*df.iloc[a][4]/395),2)) #formula
exp_val=np.array(exp_val)

In [7]:
exp_val

array([[50.89, 49.87, 50.38, 49.87],
       [49.11, 48.13, 48.62, 48.13]])

In [8]:
l=[]
for i in range(len(exp_val)):
    for b in range(4):
        l.append(np.square(observed_value[i][b]-exp_val[i][b])/observed_value[i][b]) #formula
chi_val=round(sum(l),2)
if chi_val>value:
    print("Null Hypothesis is rejected (Gender and education level are dependent.)")
else:
    print('Null Hypothesis is accepted (Gender and education level are independent.)')

Null Hypothesis is rejected (Gender and education level are dependent.)

# Problem Statement 2:
Using the following data, perform a oneway analysis of variance using Î±=.05. Write 
up the results in APA format.<br>
[Group1: 51, 45, 33, 45, 67]<br>
[Group2: 23, 43, 23, 43, 45]<br>
[Group3: 56, 76, 74, 87, 56]

In [9]:
#null hypothesis means of all the groups are same/similar
#alternative hypothesis means of all the groups are not same/similar
alpha=0.05
df=pd.DataFrame({"Group1":[51,45,33,45,67],"Group2":[23,43,23,43,45],"Group3":[56,76,74,87,56]})

In [10]:
df

   Group1  Group2  Group3
0      51      23      56
1      45      43      76
2      33      23      74
3      45      43      87
4      67      45      56

In [11]:
N,n,a=15,5,3 #N is the total observation in the data , n is the observation in a single column of the data, a is the number of columns
dfbtw=a-1
dfwithin=N-a
dftotal=N-1

In [12]:
(dfbtw,dfwithin) #go to f table and find the value 
value=3.8853
#decision rule if f value is greater than 3.8853 we reject null hypothesis

In [13]:
ssbetw=(sum([np.square(sum(df['Group1'])),np.square(sum(df['Group2'])),np.square(sum(df['Group3']))])/n)-(sum([sum(df['Group1']),sum(df['Group2']),sum(df['Group3'])])/N)

In [14]:
ssbetw

42191.066666666666

In [15]:
a=sum([a*a for a in df['Group1']])
b=sum([b*b for b in df['Group2']])
c=sum([b*b for b in df['Group3']])
#sum([a,b,c])==51*51+45*45+33*33+45*45+67*67+23*23+43*43+23*23+43*43+45*45+56*56+76*76+74*74+87*87+56*56

In [16]:
sswithin=(sum([a,b,c]))-(sum([np.square(sum(df['Group1'])),np.square(sum(df['Group2'])),np.square(sum(df['Group3']))])/n)

In [17]:
sswithin

1860.800000000003

In [18]:
sstotal=ssbetw+sswithin

In [19]:
sstotal

44051.86666666667

In [20]:
msbetw=ssbetw/dfbtw
mswithin=sswithin/dfwithin

In [21]:
print(msbetw)
print(mswithin)

21095.533333333333
155.06666666666692

In [22]:
f=msbetw/mswithin

In [23]:
f

136.04170249355093

In [24]:
if f>value:
    print("We reject null hypothesis and conclude that means of the groups are different")
else:
    print("We accept null hypothesis means of the group are same")

We reject null hypothesis . Means of the groups are different

# Problem Statement 3:
Calculate F Test for given 10, 20, 30, 40, 50 and 5,10,15, 20, 25.
For 10, 20, 30, 40, 50

In [25]:
s1=[10,20,30,40,50]
s2=[5,10,15,20,25]
f,p=st.f_oneway(s1,s2) #got this from google
print("F-value is :",f)
print("p-value is :",p)

F-value is : 3.6
p-value is : 0.0943497728424377